[
  {
    "title": "To switch or not?",
    "date": "2026-01-17",
    "content": "<b>Ever felt a sting to not switch tasks?</b> You're working on a task, and suddenly you realise that you need to switch to something else. An interruption to that sweet uptake of dopamine you get while being \"zoned-in\". My parents always motivate me that I should try switching tasks quickly and switch \"zones\".<br><br><b>Why is it that I can switch between some tasks easily and some require a resolute exercise of will or actually never end up being done?</b><br> I wonder if this has got to do with plasticity. The more time you spend doing certain tasks, more does the brain adapt to those and it becomes easier to perform those tasks. Some tasks you do without paying conscious attention like typing, listening to music in the background... so, moving from no music to music while studying is never a barrier for me. But say, you're writing code in python and you suddenly need to supplement the math behind the code with commentary in latex. To conclude the response to this question, I think there may be 2 types of tasks that are difficult to switch to- one, those that you are not good at; two, those which are not particularly fun to do(do not trigger copious dopamine release). Adapting to new tasks involves rewiring, it takes energy and time. Thus, the brain naturally will try to resist expenditure of energy; makes sense, right?<br><br><br><b>Is there a way to tackle it?</b><br>I say \"fake it till you make it\". When there is resistance to switch, try to assert that you're getting good at it and you're understanding the intricacies of the task. Maybe listing some out/understanding them is a good way to start. A boost to this can be achieved with some fun activity such as a small snack or your favourite music!<br><br>Fun after-thought: Is not being in the mood for something an emotional manifestation of plasticity? or maybe it is just a skepticism expressed due to a poor past experience. <br>Given how much time we spend in our brains, it is surprising how little we try to introspect its functioning."
  },
  {
    "title": "LLMs: a growing habit with an added burden?",
    "date": "2025-06-21",
    "content": "<h4><p>I was reading a recent MIT study about accumulation of cognitive debt in GPT users, which lead to thinking about habit-forming.</p><p>It is my personal opinion that the best use case of modern LLMs is gathering information on topics you know little about. It is GOOD at giving you the relevant information - so good that an LLM has been my go-to for understanding new things lately.<br>As I was happily able to | grep(if you may 😊)new info, something concerning occurred to me - \"is this info reliable and complete?\" To verify this, I would ask the model to search for and cite sources, and then personally tap them for verification. Had I done a search for the relevant info, I could have gone straight to the source and just read that.</p><p>It becomes important to perform a fact-check when dealing with nuances in a regime you know little about. Apart from the distrust in completeness and authenticity of information that LLMs can furnish us with, there's a certain vibe to well-structured stackoverflow posts and good old blogs, that I do not see in LLMs - that human element. </p></p>From a user's perspective, I would not be comfortable to have LLMs(or LLM-driven search engines for that matter) replace a search on the web and books, for dealing with nuanced topics just YET. <br>As for getting an introduction to new ideas, LLMs are a life-saver!</p><br><br>P.S. No AI was used in crafting this post - you are likely to find deficiencies in the post upon closer inspection 😂</h4>"
  },
  {
    "title": "Why should we study Chemistry",
    "date": "28-01-22",
    "content": "<i>Wrote this during my CH107 course, in which I studied about orbitals. <br>I was extremely fortunate to have this be featured on the Facebook page of IITB's director.</i><center><a href=\"https://www.facebook.com/directoriitbombay/posts/pfbid0339ovf5roP6QHnRcwz2ATKeLGL3TgKcLchJJUMHXBYpheN3twvEkWDNYQxw7p2ASjl\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"display:block; max-width:400px; padding:15px; margin:10px 0; border:1px solid #ccc; border-radius:8px; background-color:#f0f2f5; text-decoration:none; color:#1877f2; font-family:Arial, sans-serif; font-size:16px; box-shadow:0 2px 5px rgba(0,0,0,0.1); transition:box-shadow 0.2s;\" onmouseover=\"this.style.boxShadow='0 4px 10px rgba(0,0,0,0.2)'\" onmouseout=\"this.style.boxShadow='0 2px 5px rgba(0,0,0,0.1)'\">View this Facebook post</a></center><br><br><br><br> <div style='text-align:center; font-family:\"Georgia\", serif; font-size:20px; line-height:1.0;'><h2>Why should we study Chemistry?</h2><p>Let me express this in the form of poetry.</p><p>There’s all that background story,<br>Of Planck, Einstein, Compton and de Broglie.</p><p>Then came along Schrodinger,<br>An equation was “guessed”, yes guessed!<br>Variables were separated,<br>And the two sides of the equation were integrated.</p><p>But it was a wonder as to what Psi represented!<br>To explain, Max Born postulated,<br>When and where is a particle located?<br>Everywhere and every time from negative to positive infinity,<br>But with different degrees of certainty<br>This certainty, my friend is exactly what Psi represented!</p><p>The sorcery was tried on a particle being boundless,<br>But soon the scientists ran into a problem:<br>of the Normalisation constant being limitless.</p><p>So they reacted!<br>By putting tall, stout, arrogant walls around an interval,<br>That would not let the particle escape this potential upheaval.<br>A well-behaved function is what they wanted,<br>Hence Boundary Conditions were forced,<br>And an easy sinusoidal function arose!<br>As usual, to higher dimensions this idea was extended,<br>It was here that beautiful qualitative explanations for spectroscopy emanated.</p></div>"

  },
  {
    "title": "Poem: Orbital Structures",
    "date": "February '22",
    "content": "<div style='text-align:center; font-family:\"Georgia\", serif; font-size:20px; line-height:1.0;'><p>With the Radial and Angular parts recognised,<br>The solutions of H-atom were beautifully organised.<br>First, the radial part was analysed:<br>A polynomial and an exponential were all it took,<br>But it’s not as obvious as it looked!<br>Three special numbers emerged,<br>‘n’, ‘l’, ‘m’ is what they were titled.</p><p>Then came the bewildering terminology,<br>Of Wavefunction, Density and Distribution of Probability.<br>The Angular Part was addressed now,<br>It gave different perspectives to the orbitals as it took a bow.</p><p>But then popped a question:<br>What exactly is an orbital?<br>Our Professor told us to take it to the heart:<br>An orbital is a single electron wavefunction,<br>That satisfies Schrodinger’s equation.<br>Nodes were classified,<br>Such simple formulae they satisfied!</p><p>And so we analysed,<br>s, p, d orbitals were normalised.<br>But oh! some orbitals were complex valued,<br>All they did to the seer was delude!<br>The Chemists reacted,<br>Linear Combinations of + and -m were enacted,<br>Thus, meaningful orbitals along x, y, z axes originated!</p><p>Values of average radii, energy came out as predicted,<br>With this success, multi-electron systems are what the Scientists concocted!</p></div>"
  },
  {
    "title": "Poem: Wavefunctions and Boundary Conditions",
    "date": "February '22",
    "content": "<div style='text-align:center; font-family:\"Georgia\", serif; font-size:20px; line-height:1.0;'><p>They had the tools, they had the skill,<br>Calculating the state of a Rigid Rotating Diatomic Molecule was a thrill!<br>Two bodies were reduced to a single one,<br>But the Cartesian coordinates seemed to lessen the fun.<br>So a large derivation was commissioned,<br>If you did it twice in life, you’d be crowned a Mathematician!</p><p>Once again, Variables were separated,<br>And the two sides of the equation were integrated.<br>As the problem became complex, so did the solution,<br>One part given by an easy exponential function,<br>The other part by the daunting Associated Legendre Polynomials.<br>As usual, Boundary Conditions were imposed,<br>And Viola! Quantization of Angular Momentum arose.</p><p>The Stage was set for the Star of the Show,<br>A two-particle central force problem.<br>But the Cartesian function was not separable.<br>What should be done to make the problem more approachable?<br>The Frame of Reference was Modified,<br>Coordinates were Transformed.<br>The problem seemed more approachable.<br>But patiently must the Scientists tread,<br>For a large number of calculations lay ahead.<br>They proceeded under the shield of known techniques, which luckily acted like the shield of lead.<br>Variables were separated,<br>Using the humongous Laplacian, away they differentiated!<br>Radial and Angular parts were identified,<br>And the vigour to explain a plethora of phenomena intensified!</p></div>"
  },
  {
    "title": "Astropoetry",
    "date": "2018-04-25",
    "content": "Submitted for Global Astronomy Month 2018 to astronomerswithoutborders.org<br><i>I wrote this one long ago, please exercise leniency in judgement lol</i><br><center> <h1>The Brahmand-Space</h1> <br><br><br><br> <h3>Space is humongously vast, <br> what we see in the sky now is only its past.It is like a fabric, in combination with time,<br> that is bent by stars, planets and all matter.<br> Twenty-seven percent of it is what we call \"Dark Matter\",<br> that mainly causes matter to gather.<br> Sixty-eight percent of it is \"Dark Energy\",<br> that's accelerating its expansion in a ravishing flamboyancy.<br> One thing to physicists is pissing-<br> That a lot of the predicted antimatter in space is missing!<br> A \"Black Hole\" formed from a neutron star, is a mighty dark and dense beast,<br> to whom the nearby matter and light is like a feast.<br> Some Black Holes are stationary loners<br> while some are spinning interstellar voyagers.<br> You and me and everyone are of the same age,<br>for all of the matter formed and existed long before ice age!<br> The Universe and us are all thirteen point eight billon years old,<br> and that's how the story should be usually told.<br>Comets are Curious and adventurous rocks, with icy tales.<br> Some are even doting,<br> for after travelling for hundreds of thousands of miles,<br> they do return to visit us again, but<br>they go away once again.<br> The existence of aliens is a COLASSAL question.<br> As the Tesla Roadster zips through space,<br> we can ONLY HOPE that it is found by an advanced extraterrestrial race.<br> UNTIL we ourselves, BUILD a Dyson Sphere to power advanced rocketry<br> that'll make of our current rockets a complete Mockery.<br> <br>Such is the Beauty and Diversity of our UNI-VERSE,<br> which may be dwelling in a MULTI-VERSE.<br><br></h3><br></center>"
  } 
]
