[
  {
    "title": "LLMs: a growing habit with an added burden?",
    "date": "2025-06-21",
    "content": "<h4><p>I was reading a recent MIT study about accumulation of cognitive debt in GPT users, which lead to thinking about habit-forming.</p><p>It is my personal opinion that the best use case of modern LLMs is gathering information on topics you know little about. It is GOOD at giving you the relevant information - so good that an LLM has been my go-to for understanding new things lately.<br>As I was happily able to | grep(if you may 😊)new info, something concerning occurred to me - \"is this info reliable and complete?\" To verify this, I would ask the model to search for and cite sources, and then personally tap them for verification. Had I done a search for the relevant info, I could have gone straight to the source and just read that.</p><p>It becomes important to perform a fact-check when dealing with nuances in a regime you know little about. Apart from the distrust in completeness and authenticity of information that LLMs can furnish us with, there's a certain vibe to well-structured stackoverflow posts and good old blogs, that I do not see in LLMs - that human element. </p></p>From a user's perspective, I would not be comfortable to have LLMs(or LLM-driven search engines for that matter) replace a search on the web and books, for dealing with nuanced topics just YET. <br>As for getting an introduction to new ideas, LLMs are a life-saver!</p><br><br>P.S. No AI was used in crafting this post - you are likely to find deficiencies in the post upon closer inspection 😂</h4>"
  },
  {
    "title": "Astropoetry",
    "date": "2018-04-25",
    "content": "Submitted for Global Astronomy Month 2018 to astronomerswithoutborders.org<br><i>I wrote this one long ago, please exercise leniency in judgement lol</i><br><center> <font style = \"font-family: helvetica\"><h1>The Brahmand-Space</h1> <br><br><br><br> <h3>Space is humongously vast, <br> what we see in the sky now is only its past.It is like a fabric, in combination with time,<br> that is bent by stars, planets and all matter.<br> Twenty-seven percent of it is what we call \"Dark Matter\",<br> that mainly causes matter to gather.<br> Sixty-eight percent of it is \"Dark Energy\",<br> that's accelerating its expansion in a ravishing flamboyancy.<br> One thing to physicists is pissing-<br> That a lot of the predicted antimatter in space is missing!<br> A \"Black Hole\" formed from a neutron star, is a mighty dark and dense beast,<br> to whom the nearby matter and light is like a feast.<br> Some Black Holes are stationary loners<br> while some are spinning interstellar voyagers.<br> You and me and everyone are of the same age,<br>for all of the matter formed and existed long before ice age!<br> The Universe and us are all thirteen point eight billon years old,<br> and that's how the story should be usually told.<br>Comets are Curious and adventurous rocks, with icy tales.<br> Some are even doting,<br> for after travelling for hundreds of thousands of miles,<br> they do return to visit us again, but<br>they go away once again.<br> The existence of aliens is a COLASSAL question.<br> As the Tesla Roadster zips through space,<br> we can ONLY HOPE that it is found by an advanced extraterrestrial race.<br> UNTIL we ourselves, BUILD a Dyson Sphere to power advanced rocketry<br> that'll make of our current rockets a complete Mockery.<br> <br>Such is the Beauty and Diversity of our UNI-VERSE,<br> which may be dwelling in a MULTI-VERSE.</h3></font><br></center>"
  } 
]
